Tekla Open API Reference for Tekla Structures 2025
Phase Methods
The Phase type exposes the following members.
Methods
Name | Description
Delete
 Deletes a phase. The current phase cannot be deleted.
GetUserProperty(String, Double)
 Retrieves a double property for the phase.
GetUserProperty(String, Int32)
 Retrieves an integer property for the phase.
GetUserProperty(String, String)
 Retrieves a string property for the phase.
Insert
 Creates a new phase.
Modify
 Modifies a phase.
Select
 Selects a phase.
SetUserProperty(String, Double)
 Sets a double property for the phase.
SetUserProperty(String, Int32)
 Sets an integer property for the phase.
SetUserProperty(String, String)
 Sets a string property for the phase.
Top
See Also
Reference
Phase Class
Tekla.Structures.Model Namespace